package day1012;
// 자바의 이름짓는 규칙(Naming Convention)
// 1. 자바의 모든 이름은 중간이나 끝에 숫자가 올수 있지만
//    숫자로 이름을 시작할 수 없다.
// 2. _를 제외한 특수문자는 이름에 사용될 수 없다.
// 3. 대소문자가 일치하는 이름은 특수한 몇몇 경우를 제외하고서는 사용할 수 없다.
// 4. 한글이름을 만들어 줄 수 있긴 하지만 한글 이름을 쓰지 말자.
// 5. 낙타등 표기법(Camel Back Notation) 
//    낙타등 표기법이란, 대소문자를 모두 사용할 수 있을때,
//    이름이 여러 단어일 경우 두번째 단어부터는 첫글자를 대문자로 적어주는 표기법이다.
//    memberaccountcontroller -> memberAccountController
// 6. 뱀 표기법(Snake Notation)
//    뱀 표기법이란, 대문자만 사용하여 이름을 지어줄 경우,
//    단어의 사이마다 _를 넣어서 단어를 구분시켜주는 방법이다.
//    USERACCOUNTDIRECTORY -> USER_ACCOUNT_DIRECTORY
// 7. 자바에서는 내부적으로 사용되는 중요한 단어들을 키워드 라고 설정해놓았다.
//    그리고 우리는 이름을 지을 때 키워드와 동일한 스펠링으로 이름을 지어줄 수 없다.
//    IDE를 사용하게 되면, 그러한 키워드를 알아서 색상을 변경해서 출력해준다.
//    예를 들어, Eclipse의 경우에는 키워드를 자주색으로 표시해준다.
//    만약 여러분들이 어떤 이름을 지었는데, 자주색으로 표시되면 동의어를 사용하거나
//    변경을 가해주면 된다!

// 종류에 따른 이름 규칙
// 1. 클래스
//    클래스는 대문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// 2. 패키지
//    패키지는 소문자로 시작하고 모여있는 클래스를 나타내는 한 단어의 명사이다.
// 3. 메소드
//    메소드는 소문자로 시작하고 낙타등 표기법을 사용하는 동사이다.
//    단, 프로그래밍의 문법상 메소드는 반드시 이름 뒤에 ()가 붙는다.
// 4. 변수
//    변수는 소문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// 5. 상수
//    상수는 뱀 표기법을 사용하는 명사이다.

public class Ex03Naming {
    public static void main(String[] args) {
        
    }

}
