package day1014;
// 제어문 (Control Statement)
// 제어문이란 특정 코드(들)의 실행 여부, 혹은 특정 코드(들)의 반복을
// 제어하는 특수한 코드이다.
// 제어문들은 주로 true 혹은 false가 나오는 조건식을 토대로 해서
// true 이면 코드를 실행 혹은 반복
// false이면 종료가 되는 형태를 가지게 된다.

// 제어문에는 크게 조건문과 반복문이 있다.
// 조건문: 조건식이 true가 나오면 코드(들)을 실행
//       크게 if문과 switch문이 있다.
// 반복문: 조건식이 true가 나오는 동안 코드(들)을 반복
//       크게 while문과 for문이 있다.

// 단, 각각의 제어문은 쓰는 사용처가 각자 다르다.

// 조건식
// 조건식이란 결과 값이 true 혹은 false, 즉 boolean 데이터타입의 값이 나오는
// 코드를 조건식이라고 한다.
// 가장 대표적으로 비교연산자를 사용한 코드가 조건식이 될 수 있다.
// 혹은 equals() 메소드와 같이 결과값이 true/false가 나오는 메소드도 조건식이 된다.

// 코드 블락
// 코드 블락이란, 한개의 중괄호 { } 사이를 코드 블락이라고 한다.
// 한개의 코드 블락 안에는 여러개의 코드 블락이 들어갈 수도 있다.
// 첫번째로, 제어문의 조건식에 따라 어떤 코드를 실행할지 혹은 반복할지
// 번위를 지정할 때 코드 블락을 쓰기 때문이다.
// 두번째로, 변수의 유효범위는 코드발락과 연결되어 있다.
// 변수의 유효범위의 시작은 해당 변수가 선언된 시점부터이다.
// 해당 변수의 유효범위의 끝은 그 변수가 선언도니 코드 블락이 끝날때이다.
// 어떤 변수의 유효범위 안에서는 똑같은 이름의 변수는 다시 선언할 수 없다.
// 또한, 유효범위가 끝나면 해당 변수는 메모리에서 사라진다.


public class Ex05ControlStatement {
    public static void main(String[] args) {
        
    }

}
